permintaan-barang/app/Models/PermintaanModel.php

SELECT `p`.*, `u`.`nama` as `nama_karyawan`
FROM `permintaan` `p`
JOIN `users` `u` ON `u`.`id` = `p`.`user_id`
WHERE `p`.`status` = 'Pending'
ORDER BY `p`.`created_at` DESC
---
    public function getPermintaanWithUser($status = null)
    {
        $builder = $this->db->table('permintaan p')
            ->select('p.*, u.nama as nama_karyawan')
            ->join('users u', 'u.id = p.user_id');

        if ($status && $status !== 'semua') {
            $builder->where('p.status', $status);
        }

        return $builder->orderBy('p.created_at', 'DESC')->get()->getResultArray();

SELECT *
FROM `permintaan`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
---
    public function getPermintaanByUser($user_id, $status = null)
    {
        $builder = $this->where('user_id', $user_id);
        if ($status && $status !== 'semua') {
            $builder->where('status', $status);
        }
        return $builder->orderBy('created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `status` = 'Pending'
---
    public function countPending()
    {
        return $this->where('status', 'Pending')->countAllResults();