permintaan-barang/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'budi'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();