permintaan-barang/app/Controllers/Karyawan/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `user_id` = '2'
AND `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `user_id` = '2'
AND `status` = 'Valid'
SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `user_id` = '2'
AND `status` = 'Ditolak'
---
    public function index()
    {
        $model   = new PermintaanModel();
        $id_user = session()->get('id_user');

        return view('karyawan/dashboard', [
            'title'         => 'Dashboard Karyawan',
            'total_pending' => $model->where('user_id', $id_user)->where('status', 'Pending')->countAllResults(),
            'total_valid'   => $model->where('user_id', $id_user)->where('status', 'Valid')->countAllResults(),
            'total_ditolak' => $model->where('user_id', $id_user)->where('status', 'Ditolak')->countAllResults(),