permintaan-barang/app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $permintaanModel = new PermintaanModel();
        $masterModel     = new MasterAlatKantorModel();
        $userModel       = new UserModel();
        $stats           = $masterModel->getDashboardStats();

        $data = [
            'title'           => 'Dashboard Admin',
            'total_pending'   => $permintaanModel->where('status', 'Pending')->countAllResults(),
            'total_valid'     => $permintaanModel->where('status', 'Valid')->countAllResults(),
            'total_ditolak'   => $permintaanModel->where('status', 'Ditolak')->countAllResults(),
            'total_karyawan'  => $userModel->where('role', 'karyawan')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `status` = 'Valid'
SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `status` = 'Ditolak'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'karyawan'