permintaan-barang/app/Controllers/Admin/Permintaan.php

    public function index()
    {
        $model  = new PermintaanModel();
        $status = $this->request->getGet('status') ?? 'semua';
        $cari   = $this->request->getGet('cari') ?? '';

        $builder = $this->db->table('permintaan p')
            ->select('p.*, u.nama as nama_karyawan')
            ->join('users u', 'u.id = p.user_id');

        if ($status && $status !== 'semua') {
            $builder->where('p.status', $status);
        }

        if ($cari) {
            $builder->groupStart()
                ->like('u.nama', $cari)
                ->orLike('p.nama_permintaan', $cari)
                ->groupEnd();
        }

        $permintaan = $builder->orderBy('p.created_at', 'DESC')->get()->getResultArray();
---
SELECT `p`.*, `u`.`nama` as `nama_karyawan`
FROM `permintaan` `p`
JOIN `users` `u` ON `u`.`id` = `p`.`user_id`
ORDER BY `p`.`created_at` DESC